sdaiTestArrayByIndex(Sdai_Id_aggr*,System.UInt32)
\details
Determines whether the element value in a specified array is set.
\param array [in] An array that contains the element.
\param index [in] An index of the array element.
\returns sdaiTRUE if the element with the specified index has a set value; otherwise, the function returns sdaiFALSE.